cases/bigleafFoam/cubeTree/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; // hb=0.12

vertices
(
    (0 0 0)
    (12 0 0)
    (18 0 0)
    (48 0 0)
    (0 0 4)
    (12 0 4)
    (18 0 4)
    (48 0 4)
    (0 0 10)
    (12 0 10)
    (18 0 10)
    (48 0 10)
    (0 0 30)
    (12 0 30)
    (18 0 30)
    (48 0 30)
    (0 12 0)
    (12 12 0)
    (18 12 0)
    (48 12 0)
    (0 12 4)
    (12 12 4)
    (18 12 4)
    (48 12 4)
    (0 12 10)
    (12 12 10)
    (18 12 10)
    (48 12 10)
    (0 12 30)
    (12 12 30)
    (18 12 30)
    (48 12 30)
    (0 18 0)
    (12 18 0)
    (18 18 0)
    (48 18 0)
    (0 18 4)
    (12 18 4)
    (18 18 4)
    (48 18 4)
    (0 18 10)
    (12 18 10)
    (18 18 10)
    (48 18 10)
    (0 18 30)
    (12 18 30)
    (18 18 30)
    (48 18 30)
    (0 30 0)
    (12 30 0)
    (18 30 0)
    (48 30 0)
    (0 30 4)
    (12 30 4)
    (18 30 4)
    (48 30 4)
    (0 30 10)
    (12 30 10)
    (18 30 10)
    (48 30 10)
    (0 30 30)
    (12 30 30)
    (18 30 30)
    (48 30 30)

);

blocks
(
    hex (0 1 17 16 4 5 21 20)
    fluid1 (10 10 10) simpleGrading (1 1 1)

    hex (1 2 18 17 5 6 22 21)
    fluid2 (10 10 10) simpleGrading (1 1 1)

    hex (2 3 19 18 6 7 23 22)
    fluid3 (10 10 10) simpleGrading (1 1 1)

    hex (4 5 21 20 8 9 25 24)
    fluid4 (10 10 10) simpleGrading (1 1 1)

    hex (5 6 22 21 9 10 26 25)
    fluid5 (10 10 10) simpleGrading (1 1 1)

    hex (6 7 23 22 10 11 27 26)
    fluid6 (10 10 10) simpleGrading (1 1 1)

    hex (8 9 25 24 12 13 29 28)
    fluid7 (10 10 10) simpleGrading (1 1 1)

    hex (9 10 26 25 13 14 30 29)
    fluid8 (10 10 10) simpleGrading (1 1 1)

    hex (10 11 27 26 14 15 31 30)
    fluid9 (10 10 10) simpleGrading (1 1 1)

    hex (16 17 33 32 20 21 37 36)
    fluid10 (10 10 10) simpleGrading (1 1 1)

    hex (17 18 34 33 21 22 38 37)
    fluid11 (10 10 10) simpleGrading (1 1 1)

    hex (18 19 35 34 22 23 39 38)
    fluid12 (10 10 10) simpleGrading (1 1 1)

    hex (20 21 37 36 24 25 41 40)
    fluid13 (10 10 10) simpleGrading (1 1 1)

    hex (21 22 38 37 25 26 42 41)
    vegetation (10 10 10) simpleGrading (1 1 1)

    hex (22 23 39 38 26 27 43 42)
    fluid15 (10 10 10) simpleGrading (1 1 1)

    hex (24 25 41 40 28 29 45 44)
    fluid16 (10 10 10) simpleGrading (1 1 1)

    hex (25 26 42 41 29 30 46 45)
    fluid17 (10 10 10) simpleGrading (1 1 1)

    hex (26 27 43 42 30 31 47 46)
    fluid18 (10 10 10) simpleGrading (1 1 1)

    hex (32 33 49 48 36 37 53 52)
    fluid19 (10 10 10) simpleGrading (1 1 1)

    hex (33 34 50 49 37 38 54 53)
    fluid20 (10 10 10) simpleGrading (1 1 1)

    hex (34 35 51 50 38 39 55 54)
    fluid21 (10 10 10) simpleGrading (1 1 1)

    hex (36 37 53 52 40 41 57 56)
    fluid22 (10 10 10) simpleGrading (1 1 1)

    hex (37 38 54 53 41 42 58 57)
    fluid23 (10 10 10) simpleGrading (1 1 1)

    hex (38 39 55 54 42 43 59 58)
    fluid24 (10 10 10) simpleGrading (1 1 1)

    hex (40 41 57 56 44 45 61 60)
    fluid25 (10 10 10) simpleGrading (1 1 1)

    hex (41 42 58 57 45 46 62 61)
    fluid26 (10 10 10) simpleGrading (1 1 1)

    hex (42 43 59 58 46 47 63 62)
    fluid27 (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
            (16 32 36 20)
            (20 36 40 24)
            (24 40 44 28)
            (32 48 52 36)
            (36 52 56 40)
            (40 56 60 44)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)
            (19 35 39 23)
            (23 39 43 27)
            (27 43 47 31)
            (35 51 55 39)
            (39 55 59 43)
            (43 59 63 47)

        );
    }
    sky
    {
        type wall;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
            (28 29 45 44)
            (29 30 46 45)
            (30 31 47 46)
            (44 45 61 60)
            (45 46 62 61)
            (46 47 63 62)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)
            (32 33 49 48)
            (33 34 50 49)
            (34 35 51 50)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (48 49 53 52)
            (49 50 54 53)
            (50 51 55 54)
            (52 53 57 56)
            (53 54 58 57)
            (54 55 59 58)
            (56 57 61 60)
            (57 58 62 61)
            (58 59 63 62)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
