cases/bigleafFoam/cubeTree/0.org/Dqt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Dqt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	    type            zeroGradient;
    }

    outlet
    {
	    type            zeroGradient;
    }

    sky
    {
	    type            zeroGradient;
    }

    // ground
    // {
    //     type            alphatJayatillekeWallFunction;
    //     Prt             0.85;
    //     value           uniform 0;
    // }

    ground
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
