cases/bigleafFoam/cubeTree/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../constant/flowProperties"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{

    inlet
    {
        type            groovyBC;
        variables       "zp=pos().z;";
        valueExpression "pow($ustar,3)/($kappa*zp)";
        value           uniform $turbulentEpsilon;
    }

    outlet
    {
        type            zeroGradient;
    }

    sky
    {
        type            slip;
    }

    ground
    {
        type            epsilonWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        E               $E;
        value           $internalField;
    }

    frontAndBack
    {
        type            slip;
    }
}


// ************************************************************************* //
