cases/bigleafFoam/cubeTree/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../constant/flowProperties"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant $turbulentKE;
    }

    outlet
    {
        type            zeroGradient;
    }

    sky
    {
        type            slip;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    frontAndBack
    {
        type            slip;
    }
}


// ************************************************************************* //
