cases/bigleafFoam/cubeTree/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell; //cellPointFace;

setFormat raw;

surfaceFormat foamFile;

fields
(
    U
    p
    epsilon
    nut
    k
    vorticity
    R
);


surfaces
(

    constantPlane
    {
        type            plane;    // always triangulated
        basePoint       (0 0 0.005);
        normalVector    (0 0 1);
        interpolate     true;
        triangulate     true;
        //- Optional: restrict to a particular zone
        // zone        zone1;

        //- Optional: do not triangulate (only for surfaceFormats that support
        //            polygons)
        //triangulate     false;
    }

    // triangleCut
    // {
    //     // Cutingplane using iso surface
    //     type            cuttingPlane;
    //     planeType       pointAndNormal;
    //     pointAndNormalDict
    //     {
    //         basePoint       (0 0 0.005);
    //         normalVector    (0 0 1);
    //     }
    //     interpolate     true;

    //     //zone            ABC;          // Optional: zone only
    //     //exposedPatchName fixedWalls;  // Optional: zone only

    //     // regularise      false;    // Optional: do not simplify
    //     // mergeTol        1e-10;    // Optional: fraction of mesh bounding box
    //                                  // to merge points (default=1e-6)
    // }

);

sets
(
    xOverH_0
    {
        type            face;
        axis            xyz;
        start           (0 0 0.005);
        end             (0 36 0.005);
    }
    
    xOverH_m5p0
    {
        type            face;
        axis            xyz;
        start           (-6.0 0 0.005);
        end             (-6.0 36 0.005);
    }
    xOverH_m0p5
    {
        type            face;
        axis            xyz;
        start           (-0.6 0 0.005);
        end             (-0.6 36 0.005);
    }
    xOverH_0p5
    {
        type            face;
        axis            xyz;
        start           (0.6 0 0.005);
        end             (0.6 36 0.005);
    }
    xOverH_5p0
    {
        type            face;
        axis            xyz;
        start           (6.0 0 0.005);
        end             (6.0 36 0.005);
    }
    xOverH_10p0
    {
        type            face;
        axis            xyz;
        start           (12.0 0 0.005);
        end             (12.0 36 0.005);
    }


    xOverH_0p8
    {
        type            face;
        axis            xyz;
        start           (0.96 0 0.005);
        end             (0.96 36 0.005);
    }
    xOverH_1p7
    {
        type            face;
        axis            xyz;
        start           (2.04 0 0.005);
        end             (2.04 36 0.005);
    }
    xOverH_4p2
    {
        type            face;
        axis            xyz;
        start           (5.04 0 0.005);
        end             (5.04 36 0.005);
    }

    xOverH_8p3
    {
        type            face;
        axis            xyz;
        start           (9.96 0 0.005);
        end             (9.96 36 0.005);
    }
    xOverH_12p5
    {
        type            face;
        axis            xyz;
        start           (15 0 0.005);
        end             (15 36 0.005);
    }
    xOverH_16p7
    {
        type            face;
        axis            xyz;
        start           (20.04 0 0.005);
        end             (20.04 36 0.005);
    }
    xOverH_18p3
    {
        type            face;
        axis            xyz;
        start           (21.96 0 0.005);
        end             (21.96 36 0.005);
    }
    xOverH_25p0
    {
        type            face;
        axis            xyz;
        start           (30 0 0.005);
        end             (30 36 0.005);
    }
    xOverH_29p2
    {
        type            face;
        axis            xyz;
        start           (35.04 0 0.005);
        end             (35.04 36 0.005);
    }

    xOverH_33p3
    {
        type            face;
        axis            xyz;
        start           (39.96 0 0.005);
        end             (39.96 36 0.005);
    }
    xOverH_50p0
    {
        type            face;
        axis            xyz;
        start           (60 0 0.005);
        end             (60 36 0.005); 
    }

    
    yoverH_0p38
    {
        type            face;
        axis            xyz;
        start           (-12 0.456 0.005);
        end             (96 0.456 0.005);
    }

    yoverH_1p88
    {
        type            face;
        axis            xyz;
        start           (-12 2.256 0.005);
        end             (96 2.256 0.005);
    } 

    cloud_yoverH_0p38
    {
        type    cloud;
        axis    xyz;
        points  ((-6.6296400000000002 0.45599999999999996 0.0050000000000000001)
                 (-5.04732 0.45599999999999996 0.0050000000000000001)
                 (-3.7181999999999999 0.45599999999999996 0.0050000000000000001)
                 (-2.5589999999999997 0.45599999999999996 0.0050000000000000001)
                 (-1.7612399999999999 0.45599999999999996 0.0050000000000000001)
                 (-1.18188 0.45599999999999996 0.0050000000000000001)
                 (-0.67761599999999989 0.45599999999999996 0.0050000000000000001)
                 (-0.31655999999999995 0.45599999999999996 0.0050000000000000001)
                 (-0.091935599999999992 0.45599999999999996 0.0050000000000000001)
                 (0.095217599999999999 0.45599999999999996 0.0050000000000000001)
                 (0.47668799999999995 0.45599999999999996 0.0050000000000000001)
                 (0.94009200000000004 0.45599999999999996 0.0050000000000000001)
                 (1.9219199999999999 0.45599999999999996 0.0050000000000000001)
                 (3.20424 0.45599999999999996 0.0050000000000000001)
                 (4.2411599999999998 0.45599999999999996 0.0050000000000000001)
                 (5.5784399999999996 0.45599999999999996 0.0050000000000000001)
                 (6.8883600000000005 0.45599999999999996 0.0050000000000000001)
                 (8.0619599999999991 0.45599999999999996 0.0050000000000000001)
                 (9.3451199999999996 0.45599999999999996 0.0050000000000000001)
                 (10.719719999999999 0.45599999999999996 0.0050000000000000001)
                 (12.135599999999998 0.45599999999999996 0.0050000000000000001)
                 (13.5504 0.45599999999999996 0.0050000000000000001)
                 (14.6256 0.45599999999999996 0.0050000000000000001)
                 (16.286399999999997 0.45599999999999996 0.0050000000000000001)
                 (18.0 0.45599999999999996 0.0050000000000000001)
                 (20.081999999999997 0.45599999999999996 0.0050000000000000001)
                 (21.552 0.45599999999999996 0.0050000000000000001)
                 (23.133599999999998 0.45599999999999996 0.0050000000000000001)
                 (24.759599999999999 0.45599999999999996 0.0050000000000000001)
                 (26.327999999999999 0.45599999999999996 0.0050000000000000001)
                 (27.915600000000001 0.45599999999999996 0.0050000000000000001)
                 (29.464799999999997 0.45599999999999996 0.0050000000000000001)
                 (31.052399999999999 0.45599999999999996 0.0050000000000000001)
                 (32.619599999999998 0.45599999999999996 0.0050000000000000001)
                 (34.362000000000002 0.45599999999999996 0.0050000000000000001)
                 (35.930399999999999 0.45599999999999996 0.0050000000000000001)
                 (37.615200000000002 0.45599999999999996 0.0050000000000000001)
                 (39.202799999999996 0.45599999999999996 0.0050000000000000001)
                 (40.809600000000003 0.45599999999999996 0.0050000000000000001)
                 (42.376799999999996 0.45599999999999996 0.0050000000000000001));
    }

    cloud_yoverH_1p88
    {
        type    cloud;
        axis    xyz;
        points  ((-6.7550400000000002 2.2559999999999998 0.0050000000000000001)
                 (-5.1589200000000002 2.2559999999999998 0.0050000000000000001)
                 (-3.48108 2.2559999999999998 0.0050000000000000001)
                 (-1.9532399999999999 2.2559999999999998 0.0050000000000000001)
                 (-0.61606799999999995 2.2559999999999998 0.0050000000000000001)
                 (-0.056380799999999995 2.2559999999999998 0.0050000000000000001)
                 (0.58525199999999999 2.2559999999999998 0.0050000000000000001)
                 (1.2538799999999999 2.2559999999999998 0.0050000000000000001)
                 (2.2768799999999998 2.2559999999999998 0.0050000000000000001)
                 (3.5179199999999997 2.2559999999999998 0.0050000000000000001)
                 (4.6772399999999994 2.2559999999999998 0.0050000000000000001)
                 (5.9319599999999992 2.2559999999999998 0.0050000000000000001)
                 (7.2632399999999997 2.2559999999999998 0.0050000000000000001)
                 (8.7075600000000009 2.2559999999999998 0.0050000000000000001)
                 (10.387919999999999 2.2559999999999998 0.0050000000000000001)
                 (11.935560000000001 2.2559999999999998 0.0050000000000000001)
                 (13.635599999999998 2.2559999999999998 0.0050000000000000001)
                 (15.212399999999999 2.2559999999999998 0.0050000000000000001)
                 (16.820399999999999 2.2559999999999998 0.0050000000000000001)
                 (18.641999999999999 2.2559999999999998 0.0050000000000000001)
                 (20.342400000000001 2.2559999999999998 0.0050000000000000001)
                 (21.889199999999999 2.2559999999999998 0.0050000000000000001)
                 (23.465999999999998 2.2559999999999998 0.0050000000000000001)
                 (25.165199999999999 2.2559999999999998 0.0050000000000000001)
                 (26.681999999999999 2.2559999999999998 0.0050000000000000001)
                 (28.362000000000002 2.2559999999999998 0.0050000000000000001)
                 (29.722799999999996 2.2559999999999998 0.0050000000000000001)
                 (31.468799999999998 2.2559999999999998 0.0050000000000000001)
                 (33.021599999999999 2.2559999999999998 0.0050000000000000001)
                 (34.750799999999998 2.2559999999999998 0.0050000000000000001)
                 (36.129599999999996 2.2559999999999998 0.0050000000000000001)
                 (37.839599999999997 2.2559999999999998 0.0050000000000000001)
                 (39.497999999999998 2.2559999999999998 0.0050000000000000001)
                 (41.1432 2.2559999999999998 0.0050000000000000001)
                 (42.733199999999997 2.2559999999999998 0.0050000000000000001));

    }

    cloudExp_yoverH_0p38
    {
        type    cloud;
        axis    xyz;
        points  ((-4.1895 0.45599999999999996 0.0050000000000000001)
                 (-1.0979 0.45599999999999996 0.0050000000000000001)
                 (0.78038 0.45599999999999996 0.0050000000000000001)
                 (1.6963 0.45599999999999996 0.0050000000000000001)
                 (4.2186 0.45599999999999996 0.0050000000000000001)
                 (8.2778 0.45599999999999996 0.0050000000000000001)
                 (12.509 0.45599999999999996 0.0050000000000000001)
                 (16.799 0.45599999999999996 0.0050000000000000001)
                 (33.407 0.45599999999999996 0.0050000000000000001));
    }

    cloudExp_yoverH_1p88
    {
        type    cloud;
        axis    xyz;
        points  ((-4.1986 2.2559999999999998 0.0050000000000000001)
                 (-1.1247 2.2559999999999998 0.0050000000000000001)
                 (0.77782 2.2559999999999998 0.0050000000000000001)
                 (1.6896 2.2559999999999998 0.0050000000000000001)
                 (4.1903 2.2559999999999998 0.0050000000000000001)
                 (8.2794 2.2559999999999998 0.0050000000000000001)
                 (12.48 2.2559999999999998 0.0050000000000000001)
                 (16.796 2.2559999999999998 0.0050000000000000001)
                 (33.415 2.2559999999999998 0.0050000000000000001));

    }

);
